spec/support/fixtures/vcr_cassettes/Checkout_return_page/when_the_payment_was_not_completed/fails_the_purchases_and_sends_the_buyer_back_to_checkout_to_retry.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/payment_intents
    body:
      encoding: UTF-8
      string: amount=1000&currency=usd&description=Gumroad+Charge+rZRIoAk5W2qtGOs_qEd9IA%3D%3D&metadata[purchase]=CH-rZRIoAk5W2qtGOs_qEd9IA%3D%3D&payment_method_types[0]=card&transfer_group=CH-4&statement_descriptor_suffix=edgarba1d1cee4
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/12.5.0
      Authorization:
      - Bearer <STRIPE_API_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_B0kJ8NQKR61Yaq","request_duration_ms":197}}'
      Idempotency-Key:
      - deferred_intent_test_bfbbab250a70cbd33d9be4f0e9bd84c1
      Stripe-Version:
      - '2023-10-16'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"12.5.0","lang":"ruby","lang_version":"3.4.3 p32 (2025-04-14)","platform":"arm64-darwin24","engine":"ruby","publisher":"stripe","uname":"Darwin
        Is-MacBook-Air.local 25.1.0 Darwin Kernel Version 25.1.0: Mon Oct 20 19:32:56
        PDT 2025; root:xnu-12377.41.6~2/RELEASE_ARM64_T8132 arm64","hostname":"Is-MacBook-Air.local"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 01 Jul 2026 20:31:13 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1583'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, HEAD, PUT, PATCH, POST, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required,
        X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Content-Security-Policy:
      - base-uri 'none'; default-src 'none'; form-action 'none'; frame-ancestors 'none';
        img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'; worker-src
        'none'; upgrade-insecure-requests; report-uri https://q.stripe.com/csp-violation?q=BkyzSpLEzuu5FYhf8y_w27gs5NkRcwH_ilrL5wvz4toiPUJonUOtIcBElfD4AItOVArotY0TtwNUjhGk;
        report-to csp
      Idempotency-Key:
      - deferred_intent_test_bfbbab250a70cbd33d9be4f0e9bd84c1
      Original-Request:
      - req_2i416gFuvbhbhN
      Report-To:
      - '{"group":"csp","max_age":8640,"endpoints":[{"url":"https://q.stripe.com/csp-report-v2?q=BkyzSpLEzuu5FYhf8y_w27gs5NkRcwH_ilrL5wvz4toiPUJonUOtIcBElfD4AItOVArotY0TtwNUjhGk&t=1"}],"include_subdomains":true}'
      Reporting-Endpoints:
      - csp="https://q.stripe.com/csp-report-v2?q=BkyzSpLEzuu5FYhf8y_w27gs5NkRcwH_ilrL5wvz4toiPUJonUOtIcBElfD4AItOVArotY0TtwNUjhGk&t=1"
      Request-Id:
      - req_2i416gFuvbhbhN
      Stripe-Notice:
      - You are using an outdated API version (2023-10-16). We recommend upgrading
        to the latest API version, 2026-06-24.dahlia. See https://docs.stripe.com/upgrades
      Stripe-Should-Retry:
      - 'false'
      Stripe-Version:
      - '2023-10-16'
      Vary:
      - Origin
      X-Stripe-Priority-Routing-Enabled:
      - 'true'
      X-Stripe-Routing-Context-Priority-Tier:
      - api-testmode
      X-Wc:
      - 3c3
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |-
        {
          "id": "pi_3ToUmqIBOqvOFDrf1TN2kkhX",
          "object": "payment_intent",
          "amount": 1000,
          "amount_capturable": 0,
          "amount_details": {
            "tip": {}
          },
          "amount_received": 0,
          "application": null,
          "application_fee_amount": null,
          "automatic_payment_methods": null,
          "canceled_at": null,
          "cancellation_reason": null,
          "capture_method": "automatic",
          "client_secret": "pi_3ToUmqIBOqvOFDrf1TN2kkhX_secret_mU5aEMAabt1Q2TR8mUyaSEIlb",
          "confirmation_method": "automatic",
          "created": 1782937872,
          "currency": "usd",
          "customer": null,
          "customer_account": null,
          "description": "Gumroad Charge rZRIoAk5W2qtGOs_qEd9IA==",
          "excluded_payment_method_types": null,
          "invoice": null,
          "last_payment_error": null,
          "latest_charge": null,
          "livemode": false,
          "managed_payments": {
            "enabled": false
          },
          "metadata": {
            "purchase": "CH-rZRIoAk5W2qtGOs_qEd9IA=="
          },
          "next_action": null,
          "on_behalf_of": null,
          "payment_method": null,
          "payment_method_configuration_details": null,
          "payment_method_options": {
            "card": {
              "installments": null,
              "mandate_options": null,
              "network": null,
              "request_three_d_secure": "automatic"
            }
          },
          "payment_method_types": [
            "card"
          ],
          "processing": null,
          "receipt_email": null,
          "review": null,
          "setup_future_usage": null,
          "shared_payment_granted_token": null,
          "shipping": null,
          "source": null,
          "statement_descriptor": null,
          "statement_descriptor_suffix": "edgarba1d1cee4",
          "status": "requires_payment_method",
          "transfer_data": null,
          "transfer_group": "CH-4"
        }
  recorded_at: Wed, 01 Jul 2026 20:31:13 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/payment_intents/pi_3ToUmqIBOqvOFDrf1TN2kkhX
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/12.5.0
      Authorization:
      - Bearer <STRIPE_API_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_2i416gFuvbhbhN","request_duration_ms":216}}'
      Stripe-Version:
      - '2023-10-16'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"12.5.0","lang":"ruby","lang_version":"3.4.3 p32 (2025-04-14)","platform":"arm64-darwin24","engine":"ruby","publisher":"stripe","uname":"Darwin
        Is-MacBook-Air.local 25.1.0 Darwin Kernel Version 25.1.0: Mon Oct 20 19:32:56
        PDT 2025; root:xnu-12377.41.6~2/RELEASE_ARM64_T8132 arm64","hostname":"Is-MacBook-Air.local"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 01 Jul 2026 20:31:13 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1583'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, HEAD, PUT, PATCH, POST, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required,
        X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Content-Security-Policy:
      - base-uri 'none'; default-src 'none'; form-action 'none'; frame-ancestors 'none';
        img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'; worker-src
        'none'; upgrade-insecure-requests; report-uri https://q.stripe.com/csp-violation?q=BkyzSpLEzuu5FYhf8y_w27gs5NkRcwH_ilrL5wvz4toiPUJonUOtIcBElfD4AItOVArotY0TtwNUjhGk;
        report-to csp
      Report-To:
      - '{"group":"csp","max_age":8640,"endpoints":[{"url":"https://q.stripe.com/csp-report-v2?q=BkyzSpLEzuu5FYhf8y_w27gs5NkRcwH_ilrL5wvz4toiPUJonUOtIcBElfD4AItOVArotY0TtwNUjhGk&t=1"}],"include_subdomains":true}'
      Reporting-Endpoints:
      - csp="https://q.stripe.com/csp-report-v2?q=BkyzSpLEzuu5FYhf8y_w27gs5NkRcwH_ilrL5wvz4toiPUJonUOtIcBElfD4AItOVArotY0TtwNUjhGk&t=1"
      Request-Id:
      - req_gOW1s7fRIMLtE4
      Stripe-Notice:
      - You are using an outdated API version (2023-10-16). We recommend upgrading
        to the latest API version, 2026-06-24.dahlia. See https://docs.stripe.com/upgrades
      Stripe-Version:
      - '2023-10-16'
      Vary:
      - Origin
      X-Stripe-Priority-Routing-Enabled:
      - 'true'
      X-Stripe-Routing-Context-Priority-Tier:
      - api-testmode
      X-Wc:
      - 3c3
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |-
        {
          "id": "pi_3ToUmqIBOqvOFDrf1TN2kkhX",
          "object": "payment_intent",
          "amount": 1000,
          "amount_capturable": 0,
          "amount_details": {
            "tip": {}
          },
          "amount_received": 0,
          "application": null,
          "application_fee_amount": null,
          "automatic_payment_methods": null,
          "canceled_at": null,
          "cancellation_reason": null,
          "capture_method": "automatic",
          "client_secret": "pi_3ToUmqIBOqvOFDrf1TN2kkhX_secret_mU5aEMAabt1Q2TR8mUyaSEIlb",
          "confirmation_method": "automatic",
          "created": 1782937872,
          "currency": "usd",
          "customer": null,
          "customer_account": null,
          "description": "Gumroad Charge rZRIoAk5W2qtGOs_qEd9IA==",
          "excluded_payment_method_types": null,
          "invoice": null,
          "last_payment_error": null,
          "latest_charge": null,
          "livemode": false,
          "managed_payments": {
            "enabled": false
          },
          "metadata": {
            "purchase": "CH-rZRIoAk5W2qtGOs_qEd9IA=="
          },
          "next_action": null,
          "on_behalf_of": null,
          "payment_method": null,
          "payment_method_configuration_details": null,
          "payment_method_options": {
            "card": {
              "installments": null,
              "mandate_options": null,
              "network": null,
              "request_three_d_secure": "automatic"
            }
          },
          "payment_method_types": [
            "card"
          ],
          "processing": null,
          "receipt_email": null,
          "review": null,
          "setup_future_usage": null,
          "shared_payment_granted_token": null,
          "shipping": null,
          "source": null,
          "statement_descriptor": null,
          "statement_descriptor_suffix": "edgarba1d1cee4",
          "status": "requires_payment_method",
          "transfer_data": null,
          "transfer_group": "CH-4"
        }
  recorded_at: Wed, 01 Jul 2026 20:31:13 GMT
recorded_with: VCR 6.2.0
